#pragma once
#include "../Terminal/trmParameters.h"


namespace Command
{
    ///--------------------------------------------------------------------------------------








     ///=====================================================================================
    ///
    /// Команда настройки даты на контроллере
    /// 
    /// 
    /// 
    ///--------------------------------------------------------------------------------------
    class ACommandDate
    {
        public:

            static String name() { return F("date");}
            static void execute(const Terminal::AParameters &param, Stream *console);
            static void help(Stream *console);
    };
    ///--------------------------------------------------------------------------------------






     ///=====================================================================================
    ///
    /// Команда настройки времени на контроллере
    /// 
    /// 
    /// 
    ///--------------------------------------------------------------------------------------
    class ACommandTime
    {
        public:

            static String name() { return F("time");}
            static void execute(const Terminal::AParameters &param, Stream *console);
            static void help(Stream *console);
    };
    ///--------------------------------------------------------------------------------------





    ///--------------------------------------------------------------------------------------
}