#pragma once
#include <Arduino.h>
#include "../Terminal/trmParameters.h"


namespace Command
{
    ///--------------------------------------------------------------------------------------








     ///=====================================================================================
    ///
    /// КОманда терминала, выводит помощь по всем командам
    /// 
    /// 
    /// 
    ///--------------------------------------------------------------------------------------
    class ACommandHelp
    {
        public:

            static String name() { return F("Help");}
            static void execute(const Terminal::AParameters &param, Stream *console);
            static void help(Stream *console)
            {
                
            }

    };
    ///--------------------------------------------------------------------------------------








    ///--------------------------------------------------------------------------------------
}