#pragma once
#include <Arduino.h>
#include "../Terminal/trmParameters.h"


namespace Command
{
    ///--------------------------------------------------------------------------------------








     ///=====================================================================================
    ///
    /// Команда которая показывает состояние энергонезависемой памяти
    /// 
    /// 
    /// 
    ///--------------------------------------------------------------------------------------
    class ACommandStorage
    {
        public:

            static String name() { return F("Storage");}
            static void execute(const Terminal::AParameters &param, Stream *console);
            static void help(Stream *console);

    };
    ///--------------------------------------------------------------------------------------








    ///--------------------------------------------------------------------------------------
}