#pragma once
#include <Arduino.h>
#include "../Terminal/trmParameters.h"


namespace Command
{
    ///--------------------------------------------------------------------------------------








     ///=====================================================================================
    ///
    /// Временная команда для внутренних тестов
    /// 
    /// 
    /// 
    ///--------------------------------------------------------------------------------------
    class ACommandTest
    {
        public:

            static String name() { return F("Test");}
            static void execute(const Terminal::AParameters &param, Stream *console);
            static void help(Stream *console)
            {
                console->println();
            }

    };
    ///--------------------------------------------------------------------------------------








    ///--------------------------------------------------------------------------------------
}