#pragma once
#include <Arduino.h>
#include "trmParameters.h"

namespace Command
{
	///--------------------------------------------------------------------------------------





     ///=====================================================================================
	///
	/// КОманда терминала, выводит помощь по всем командам
	/// 
    /// 
	/// 
	///--------------------------------------------------------------------------------------
    class ACommandHelp
    {
        public:

            static String name() { return F("help");}
            static void execute(const Terminal::AParameters &param, Stream &console);
  

    };
	///--------------------------------------------------------------------------------------



	///--------------------------------------------------------------------------------------
}