#pragma once
#include <Arduino.h>
#include "trmParameters.h"


namespace Command
{
    ///--------------------------------------------------------------------------------------








     ///=====================================================================================
    ///
    /// КОманда терминала, выводит информацию по памяти
    /// 
    /// 
    /// 
    ///--------------------------------------------------------------------------------------
    class ACommandMemory
    {
        public:

            static String name() { return F("Memory");}
            static void execute(const Terminal::AParameters &param, Stream *console);
            static void help(Stream *console);
    };
    ///--------------------------------------------------------------------------------------








    ///--------------------------------------------------------------------------------------
}