#include "cmdMemory.h"
#include "configuration.h"

using namespace Command;
///--------------------------------------------------------------------------------------







 ///=====================================================================================
///
/// Команда вывод информации по внутренней памяти девайса
/// 
/// 
/// 
///--------------------------------------------------------------------------------------
 void ACommandMemory::help(Stream *console)
 {
      console->println(F("Reported free memory"));
 }
///--------------------------------------------------------------------------------------





 ///=====================================================================================
///
/// вывод количество свободной памяти
/// 
/// 
/// 
///--------------------------------------------------------------------------------------
int availableMemory() 
{
    extern int __heap_start, *__brkval;
    int v;
    return (int) &v - (__brkval == 0 ? (int) &__heap_start : (int) __brkval);
}
///--------------------------------------------------------------------------------------





void ACommandMemory::execute(const Terminal::AParameters &param, Stream *console)
{
    console->print(F("Available memory: "));
    console->print(availableMemory());
    console->println(F(" byte"));
}