#include "cmdStorage.h"
#include "sysStorage.h"
///--------------------------------------------------------------------------------------




///--------------------------------------------------------------------------------------
using namespace Command;
///--------------------------------------------------------------------------------------





 ///=====================================================================================
///
/// Команда вывод информации по сохраняемым данным
/// 
/// 
/// 
///--------------------------------------------------------------------------------------
 void ACommandStorage::help(Stream *console)
 {
      console->println(F("Reported flash storag usage"));
 }
///--------------------------------------------------------------------------------------






void ACommandStorage::execute(const Terminal::AParameters &param, Stream *console)
{
    sys::AStorage storage;
    if (param.isEmpty())
    {
        storage.dump(console);
    }

}