#pragma once
#include <Arduino.h>
#include <Controllino.h>

#include "trmParameters.h"


namespace Command
{
    ///--------------------------------------------------------------------------------------








     ///=====================================================================================
    ///
    /// Команда настройки времени на контроллере
    /// 
    /// 
    /// 
    ///--------------------------------------------------------------------------------------
    class ACommandTime
    {
        public:

            static String name() { return F("time");}
            static void execute(const Terminal::AParameters &param, Stream &console);
            static void help(Stream &console);
    

    };
    ///--------------------------------------------------------------------------------------







    ///--------------------------------------------------------------------------------------
}