
/*
    по возможности не использовать STL
*/
#include <Arduino.h>
#include <Controllino.h>



#include "sysTimer.h"
#include "commonTerminal.h"
#include "Network.h"
///--------------------------------------------------------------------------------------




///--------------------------------------------------------------------------------------
Time::ASlowTimer slowTimer; //медленный таймер
///--------------------------------------------------------------------------------------




 ///=====================================================================================
///
/// настройка
/// 
/// 
///--------------------------------------------------------------------------------------
void setup() 
{
    Controllino_RTC_init();



    Network::ethernet.setup();
    Common::providerServer.setup();
    Common::providerSerial.setup();
    

    pinMode(CONTROLLINO_D0, OUTPUT);
}
///--------------------------------------------------------------------------------------





 ///=====================================================================================
///
/// 
/// 
/// 
///--------------------------------------------------------------------------------------
void loop() 
{
    if (slowTimer.active())
    {
        //обработка терминала
        Common::terminal.update();
        Common::providerServer.update();
        Common::providerSerial.update();
    }

    //обработка нажатия кнопок

    //обработка выводов
    //relay
    
}
