
/*
    по возможности не использовать STL
*/
#include <Arduino.h>



#include "configuration.h"
#include "sysTimer.h"
#include "netSystem.h"
#include "cmdTerminal.h"
///--------------------------------------------------------------------------------------




///--------------------------------------------------------------------------------------
Time::ASlowTimer slowTimer; //медленный таймер
///--------------------------------------------------------------------------------------




 ///=====================================================================================
///
/// настройка
/// 
/// 
///--------------------------------------------------------------------------------------
void setup() 
{
    Board::setup();

    Network::ethernet.setup();
    Terminal::providerServer.setup();
    Terminal::providerSerial.setup();
    
}
///--------------------------------------------------------------------------------------





 ///=====================================================================================
///
/// 
/// 
/// 
///--------------------------------------------------------------------------------------
void loop() 
{
    if (slowTimer.active())
    {
        //обработка терминала
        Terminal::terminal.update();
        Terminal::providerServer.update();
        Terminal::providerSerial.update();
    }

    //обработка нажатия кнопок

    //обработка выводов
    //relay
    
    
}
