#pragma once
#include <Arduino.h>
#include <Stream.h>

namespace Network
{
    ///--------------------------------------------------------------------------------------



    ///--------------------------------------------------------------------------------------
    namespace Settings
    {
        constexpr uint16_t port = 23; //порт подключения к устройству
    }
    ///--------------------------------------------------------------------------------------







     ///=====================================================================================
    ///
    /// Система сетевого взаимодействия
    /// 
    /// 
    /// 
    ///--------------------------------------------------------------------------------------
    class AEthernet
    {
        public:

            void setup(); //настройка сетевого интерфейса

        public:


            String MACAddress() const;
            String localIP() const;
            String subnetMask() const;
            String gatewayIP() const;
            String dnsServerIP() const;

            bool link() const; //есть или нет соеденение 

        public:


            Stream& terminalAvailable(); //возваритим подключенного терминал клиента
    };
    ///--------------------------------------------------------------------------------------



    ///--------------------------------------------------------------------------------------
    extern AEthernet ethernet;
    ///--------------------------------------------------------------------------------------



    ///--------------------------------------------------------------------------------------
}