#pragma once
#include <Stream.h>

namespace Terminal
{
	///--------------------------------------------------------------------------------------





     ///=====================================================================================
	///
	/// Система ввода пользователя и пароля
	/// проверка аутентификации
	/// 
	///--------------------------------------------------------------------------------------
    class ALogin
    {
        public:

            enum EStatus
            {
                accept,     //доступ разрешен
                deny,       //доступ запрещен
                processing  //идет процесс авторизации
            };

            
            EStatus process(Stream *stream); //процесс аутентификации
            
        private:

         

    };

}