#pragma once
#include <Arduino.h>

namespace Terminal
{
	///--------------------------------------------------------------------------------------





     ///=====================================================================================
	///
	/// Разбор параметров
	/// 
	/// 
	///--------------------------------------------------------------------------------------
    class AParameters
    {
        public:
            AParameters(const String &data);
         
            String source() const; //Возвратить все данные которые есть
            
        private:

            String mData;

    };

}