#pragma once
#include <Stream.h>

namespace Terminal
{
	///--------------------------------------------------------------------------------------





	///--------------------------------------------------------------------------------------
    namespace Settings
    {
        constexpr int lengthAuth = 10; //максимальное количество символов системе аккаунта
    }
	///--------------------------------------------------------------------------------------





     ///=====================================================================================
	///
	/// Система ввода пользователя и пароля
	/// проверка аутентификации
    ///
	///--------------------------------------------------------------------------------------
    class ASecurity
    {
        public:

            enum EAuthentication
            {
                allow,      //доступ разрешен
                deny,       //доступ запрещен
                processing  //идет процесс авторизации
            };
    };
	///--------------------------------------------------------------------------------------






     ///=====================================================================================
	///
	/// без проверки аутентификации
	/// 
	///--------------------------------------------------------------------------------------
    class ASecurityFree
        :
            public ASecurity
    {
        public:

            EAuthentication process(Stream &stream) { return allow; };
    };
    ///--------------------------------------------------------------------------------------






     ///=====================================================================================
	///
	/// Проверка аутентификации
    /// через логин пароль
	/// 
	///--------------------------------------------------------------------------------------
    class ASecurityLogin
        :
            public ASecurity
    {
        public:

            EAuthentication process(Stream &stream);

        private:

            //текущее состояние ввода аккаунта
            enum EStatus
            {
                ready,          //готов к вводу данных
                inputLogin,     //ввод логина
                inputPasswd     //ввод пароля
            };

            EStatus mStatus     = { ready };    //текущее состояния ввода
            Stream* mSession    = { nullptr };  //поток который начал аутентификацию
            String  mLogin;                     //вводные данные имя пользователя
            String  mPasswd;                    //пароль

        private:

            EAuthentication cmd_ready       (Stream *stream);
            EAuthentication cmd_inputLogin  (Stream *stream);
            EAuthentication cmd_inputPasswd (Stream *stream);

            EAuthentication completedLogin  (Stream *stream); //Выполнен вод имя пользователя
            EAuthentication completedPasswd (Stream *stream); //выполнен ввод пароля

            void reset(); //сброс всего состояния

            bool isAuthentication() const; //проверка, логин пароль введен правельно или нет

    };

}