#pragma once
#include <Arduino.h>


#include "user_board001.h"


namespace Config
{

    ///--------------------------------------------------------------------------------------
    namespace Network
    {
        namespace Terminal
        {
            constexpr uint16_t          port                = 23; //порт подключения к устройству
            constexpr unsigned long     timeSession         = 1000L * 60L * 30L;     //время длины сессии с терминалом 30min
            constexpr unsigned long     timeLoginSession    = 1000L * 60L;  //время длины сессии вода пароля 1 минута
            constexpr int               lengthAuth          = 10; //максимальное количество символов системе аккаунта
        }

        namespace Mqtt
        {
            constexpr int timeReconnect = 1000L * 30L; //время пересоздания соеденения 30 секунд
        }    

    }
    ///--------------------------------------------------------------------------------------




    ///--------------------------------------------------------------------------------------
    namespace Security
    {
        
    }
    ///--------------------------------------------------------------------------------------






    ///--------------------------------------------------------------------------------------
    namespace Command
    {

        constexpr int lengthCommand = 100; //максимальное количество символов в команде


        namespace Help
        {
            constexpr int margin = 12; //отступ команды помощи
        }


    }
    ///--------------------------------------------------------------------------------------







}

