#pragma once
#include <Arduino.h>

namespace Network
{
    ///--------------------------------------------------------------------------------------








     ///=====================================================================================
    ///
    /// Система сетевого протокола
    /// 
    /// 
    /// 
    ///--------------------------------------------------------------------------------------
    class AMqtt
    {
        public:

            void setup(); //настройка сетевого интерфейса
            void update();
           
        public:


        private:

            bool reconnect(); //делам переподключение
            void onMqttMessage(int messageSize); //приходящее сообщение

        private:

            bool mLastConnect = { false };
            unsigned long mTimeReconnect = { 0 }; //время переподключение к серверу

    };
    ///--------------------------------------------------------------------------------------



    ///--------------------------------------------------------------------------------------
    extern AMqtt mqtt;
    ///--------------------------------------------------------------------------------------



    ///--------------------------------------------------------------------------------------
}