#pragma once
#include <Arduino.h>



namespace Device
{
    ///--------------------------------------------------------------------------------------




     ///=====================================================================================
    ///
    /// 
    /// Кнопка
    /// 
    /// 
    ///--------------------------------------------------------------------------------------
    class AButton
    {
        public:
            using ptr = AButton*;

        public:

            String name() const; //возвратим имя кнопки
            void setup(); //настройка кнопки
            void update(const unsigned long &time); //обновление
        public:


        protected:
            
            virtual String  onName() const = 0;     //получить имя релюхи
            virtual void    onSetup() = 0;          //общая настройка инциализация
            virtual bool    onPressed() = 0;        //нажата или нет

        private:

            void pushDown(); //нажали на кнопку
            void pushUp(); //отпустили кнопку

        private:

            unsigned long mChangeTime = { 0 };
            bool test = { false };

    };
    ///--------------------------------------------------------------------------------------





     ///=====================================================================================
    ///
    /// 
    /// <summary>
    /// Кнопка
    /// привязанное непосредственно к контроллеру
    /// </summary>
    /// 
    /// 
    ///--------------------------------------------------------------------------------------
    template<uint8_t pin, typename meta>
    class TButton
                    : public AButton
    {
        protected:

            //получить имя кнопки
            String onName() const override
            {
                return meta::name();
            }

            //общая настройка инциализация
            void onSetup() override
            {
                pinMode(pin, INPUT); //перевели ножку контроллера на ввывод
            }

            
            bool onPressed() override
            {
                return digitalRead(pin); 
            }

    };
    ///--------------------------------------------------------------------------------------








    ///--------------------------------------------------------------------------------------
}